tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

cask 'osxfuse'

brew 'bash'
brew 'coreutils'
brew 'direnv'
brew 'docker'
brew 'fasd'
brew 'ffmpeg'
brew 'git'
brew 'go'
brew 'graphviz'
brew 'heroku'
brew 'highlight'
brew 'httpie'
brew 'hub'
brew 'hunspell'
brew 'imagemagick'
brew 'jq'
brew 'lame'
brew 'libyaml'
brew 'mongodb', restart_service: true
brew 'mr'
brew 'node'
brew 'oniguruma'
brew 'openssl'
brew 'pv'
brew 'rbenv'
brew 'readline'
brew 'ripgrep'
brew 'rlwrap'
brew 'ruby'
brew 'ruby-build'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'thefuck'
brew 'tldr'
brew 'tree'
brew 'watchman'
brew 'yarn'
brew 'zsh'

# trial
brew 'git-extras'
brew 'git-standup'
brew 'gitfs'
brew 'rbenv-bundler'
brew 'rbenv-gemset'
brew 'reattach-to-user-namespace'
brew 'tmux'

# Casks
cask 'alfred'
cask 'anvil'
cask 'arduino'
cask 'arq'
cask 'atom'
cask 'bartender'
cask 'bettertouchtool'
cask 'ccmenu'
cask 'cheatsheet'
cask 'cleanmymac'
cask 'contexts'
cask 'daisydisk'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'gitbox'
cask 'github-desktop'
cask 'githubpulse'
cask 'gitify'
cask 'gitscout'
cask 'gitter'
cask 'gitup'
cask 'google-chrome'
cask 'google-drive'
cask 'hyper'
cask 'istat-menus'
cask 'iterm2'
cask 'keybase'
cask 'keyboard-maestro'
cask 'keycastr'
cask 'ksdiff'
cask 'netspot'
cask 'ngrok'
cask 'nteract'
cask 'omnifocus'
cask 'omnigraffle'
cask 'omnioutliner'
cask 'omniplan'
cask 'omnipresence'
cask 'papers'
cask 'parallels-desktop'
cask 'pdfpen'
cask 'postico'
cask 'rescuetime'
cask 'robomongo'
cask 'screenflow'
cask 'scrivener'
cask 'shiori'
cask 'sketch'
cask 'skype'
cask 'sonic-pi'
cask 'sonos'
cask 'soulver'
cask 'steam'
cask 'sublime-text'
cask 'supercollider'
cask 'suspicious-package'
cask 'typora'
cask 'vmware-fusion'
cask 'wireshark'

# trial
cask 'duet'
cask 'gitkraken'
cask 'manuscripts'
cask 'monodraw'
cask 'spectacle-editor'
cask 'texpad'

# QuickLooks
cask 'betterzipql'
cask 'jupyter-notebook-ql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlrest'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'

# Installed via App Store:
# cask 'base'
# cask 'dash'
# cask 'fantastical'
# cask 'gemini'
# cask 'kindle'
# cask 'wunderlist'
# cask 'xscope'

# TODO figure out how to reinstall over this
# cask 'crashplan'
