# Usage:
#   brew bundle
#   brew bundle cleanup
#   brew bundle cleanup --force

tap 'homebrew/bundle'
# tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# shells; more recent than macOS
brew 'bash'
brew 'zsh'

# shell extensions
brew 'direnv'
brew 'fasd'
brew 'tree'
brew 'thefuck'

# essentials
brew 'coreutils'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 'tmux'

# CLI
brew 'awscli'
brew 'cloc'
brew 'exa'
brew 'ffmpeg'
brew 'graphviz'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'lame'
brew 'mackup'
brew 'mr'
brew 'netlify-cli'
brew 'pandoc'
brew 'pv'
brew 'ripgrep'
brew 'rlwrap'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tldr'
brew 'trash'
brew 'wget'

# language support
brew 'go'
brew 'node'
brew 'nvm'
brew 'pipenv'
brew 'pipx'
brew 'pyenv'
brew 'python'
brew 'python@2'
brew 'python3'
brew 'rbenv'
brew 'rbenv-bundler'
brew 'rbenv-gemset'
brew 'ruby'
brew 'ruby-build'
brew 'yarn'

# libraries
brew 'gmp'
brew 'libyaml'
brew 'oniguruma'
brew 'openssl'
brew 'readline'
brew 'sqlite'

# local services
brew 'mongodb', restart_service: true
brew 'rabbitmq', restart_service: true
brew 'redis', restart_service: true
brew 'zeromq'

# development tools
brew 'docker'
brew 'entr'
brew 'git'
brew 'hub'
brew 'watchman'

# current projects use these
brew 'highlight'
brew 'ragel'

# not sure I still use these
# brew 'hunspell'
brew 'terminal-notifier'

# trial
brew 'git-extras'

###
### Casks
###

## editors & ides
cask 'arduino'
cask 'atom'
cask 'font-fira-code'
cask 'expo-xde'
cask 'nteract'
cask 'typora'

## clients
cask 'keybase'
cask 'sonos'
cask 'skype'

## developer apps
cask 'anvil'
cask 'altair-graphql-client'
cask 'ccmenu'
cask 'dash'
cask 'docker'
cask 'github'
# cask 'graphiql'
cask 'iterm2'
cask 'ksdiff'
cask 'netspot'
cask 'ngrok'
cask 'postico'
cask 'robomongo'
cask 'visual-studio-code'
cask 'wireshark'

## misc.
cask 'cheatsheet'
cask 'flux'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'steam'
cask 'supercollider'

## licensed
cask 'alfred'
cask 'arq'
cask 'bartender'
cask 'bettertouchtool'
cask 'cleanmymac'
cask 'contexts'
cask 'daisydisk'
cask 'dropbox'
cask 'hazel'
cask 'istat-menus'
cask 'keyboard-maestro'
cask 'keycastr'
cask 'omnifocus'
cask 'omnigraffle'
cask 'omnioutliner'
cask 'omniplan'
cask 'omnipresence'
cask 'papers'
cask 'parallels-desktop'
cask 'pdfpen'
cask 'postico'
cask 'rescuetime'
cask 'screenflow'
cask 'scrivener'
cask 'setapp'
cask 'sketch'
cask 'soulver'

## not currently used
# cask 'shiori'
# cask 'sonic-pi'
# cask 'sublime-text'
# cask 'vmware-fusion'

## trial
# cask 'duet'
cask 'manuscripts'

## QuickLooks
cask 'betterzipql'
cask 'jupyter-notebook-ql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlrest'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package' # also an app

## Installed via App Store
# cask 'fantastical'
# cask 'gemini'
# cask 'kaleidoscope'
# cask 'kindle'
# cask 'wunderlist'
# cask 'xscope'

## Install via SetApp
# cask 'base'
