tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

cask 'osxfuse'

brew 'bash'
brew 'coreutils'
brew 'direnv'
brew 'docker'
brew 'fasd'
brew 'ffmpeg'
brew 'git'
brew 'go'
brew 'graphviz'
brew 'heroku'
brew 'highlight'
brew 'httpie'
brew 'hub'
brew 'hunspell'
brew 'imagemagick'
brew 'jq'
brew 'lame'
brew 'libyaml'
brew 'mongodb', restart_service: true
brew 'mr'
brew 'node'
brew 'oniguruma'
brew 'openssl'
brew 'pv'
brew 'rbenv'
brew 'readline'
brew 'ripgrep'
brew 'rlwrap'
brew 'ruby'
brew 'ruby-build'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'thefuck'
brew 'tldr'
brew 'tree'
brew 'watchman'
brew 'yarn'
brew 'zsh'

# trial
brew 'git-extras'
brew 'git-standup'
brew 'gitfs'
brew 'rbenv-bundler'
brew 'rbenv-gemset'
brew 'reattach-to-user-namespace'
brew 'tmux'

cask 'ccmenu'
cask 'cheatsheet'
cask 'gitbox'
cask 'githubpulse'
cask 'gitify'
cask 'gitscout'
cask 'gitter'
cask 'keycastr'
cask 'ksdiff'
cask 'nteract'
cask 'robomongo'
